sorosaulong-ux/gd32-test-project/Library/gd32a7xx_cmp.c
/*!
    \file    gd32a7xx_cmp.c
    \brief   CMP driver

    \version 2025-08-06, V0.1.0, firmware for GD32A7xx
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32a7xx_cmp.h"

/*!
    \brief      deinitialize comparator (API_ID(0x0001U))
    \param[in]  cmp_periph: CMPx(x=0,1)
    \param[out] none
    \retval     none
*/
void cmp_deinit(uint32_t cmp_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_CMP_PERIPH(cmp_periph)) {
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x0001U), ERR_PERIPH);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(CMP0 == cmp_periph){
            /* disable CMP0 */
            cmp_disable(CMP0);
            /* reset CMP0 */
            rcu_periph_reset_enable(RCU_CMP0RST);
            rcu_periph_reset_disable(RCU_CMP0RST);
        }else if(CMP1 == cmp_periph){
            /* disable CMP1 */
            cmp_disable(CMP1);
            /* reset CMP1 */
            rcu_periph_reset_enable(RCU_CMP1RST);
            rcu_periph_reset_disable(RCU_CMP1RST);
        }else{
            /* illegal parameters */
        }
    }
}

/*!
    \brief      initialize comparator mode (API_ID(0x0002U))
    \param[in]  cmp_periph: CMPx(x=0,1)
    \param[in]  operating_mode
                only one parameter can be selected which is shown as below:
      \arg        CMP_MODE_HIGHSPEED: high speed mode
      \arg        CMP_MODE_MIDDLESPEED: medium speed mode
      \arg        CMP_MODE_LOWSPEED: low speed mode
    \param[in]  inverting_input
                only one parameter can be selected which is shown as below:
      \arg        CMP_INVERTING_INPUT_1_4VREFINT: CMP inverting input 1/4 Vrefint
      \arg        CMP_INVERTING_INPUT_1_2VREFINT: CMP inverting input 1/2 Vrefint
      \arg        CMP_INVERTING_INPUT_3_4VREFINT: CMP inverting input 3/4 Vrefint
      \arg        CMP_INVERTING_INPUT_VREFINT: CMP inverting input Vrefint
      \arg        CMP_INVERTING_INPUT_DAC_OUT: CMP inverting input DAC0_OUT0 for CMP0 or DAC1_OUT0 for CMP1
      \arg        CMP_INVERTING_INPUT_PF5_PC6: CMP inverting input PF5 for CMP0 or PC6 for CMP1
      \arg        CMP_INVERTING_INPUT_PF4_PG7: CMP inverting input PF4 for CMP0 or PG7 for CMP1
      \arg        CMP_INVERTING_INPUT_PA2_PJ11: CMP inverting input PA2 for CMP0 or PJ11 for CMP1
      \arg        CMP_INVERTING_INPUT_PC2_PA14: CMP inverting input PC2 for CMP0 or PA14 for CMP1
      \arg        CMP_INVERTING_INPUT_PA1_PK1: CMP inverting input PA1 for CMP0 or PK1 for CMP1
      \arg        CMP_INVERTING_INPUT_PF3_PK2: CMP inverting input PF3 for CMP0 or PK2 for CMP1
      \arg        CMP_INVERTING_INPUT_PH2_PG2: CMP inverting input PH2 for CMP0 or PG2 for CMP1
      \arg        CMP_INVERTING_INPUT_PH3_PG5: CMP inverting input PH3 for CMP0 or PG5 for CMP1
      \arg        CMP_INVERTING_INPUT_PA14: CMP inverting input PA14(only for CMP0)
      \arg        CMP_INVERTING_INPUT_PC6: CMP inverting input PC6(only for CMP0)
      \arg        CMP_INVERTING_INPUT_PG7: CMP inverting input PG7(only for CMP0)
    \param[in]  output_hysteresis
                only one parameter can be selected which is shown as below:
      \arg        CMP_HYSTERESIS_NO: output no hysteresis
      \arg        CMP_HYSTERESIS_LOW: output low hysteresis
      \arg        CMP_HYSTERESIS_MIDDLE: output middle hysteresis
      \arg        CMP_HYSTERESIS_HIGH: output high hysteresis
    \param[out] none
    \retval     none
*/
void cmp_mode_init(uint32_t cmp_periph, uint32_t operating_mode, uint32_t inverting_input, uint32_t output_hysteresis)
{
    uint32_t temp;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_CMP_PERIPH(cmp_periph)) {
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x0002U), ERR_PERIPH);
    }else if(NOT_CMP_OPERATING_MODE(operating_mode)){
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x0002U), ERR_PARAM_INVALID);
    }else if(NOT_CMP_INVERTING_INPUT(inverting_input)){
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x0002U), ERR_PARAM_INVALID);
    }else if(NOT_CMP_OUTPUT_HYSTERESIS(output_hysteresis)){
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x0002U), ERR_PARAM_INVALID);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        temp = CMP_CS(cmp_periph);
        /* initialize comparator  mode */
        temp &= ~(uint32_t)(CMP_CS_CMPXM | CMP_CS_CMPXMESEL | CMP_CS_CMPXMISEL | CMP_CS_CMPXHST);
        temp |= (uint32_t)(operating_mode | inverting_input | output_hysteresis);
        CMP_CS(cmp_periph) =  temp;
    }
}

/*!
    \brief      initialize comparator input (API_ID(0x0003U))
    \param[in]  cmp_periph: CMPx(x=0,1)
    \param[in]  noninverting_input
                only one parameter can be selected which is shown as below:
      \arg        CMP_NONINVERTING_DAC_OUT: CMP noninverting input DAC0_OUT0 for CMP0 or DAC1_OUT0 for CMP1
      \arg        CMP_NONINVERTING_INPUT_PF5_PC6: CMP noninverting input PF5 for CMP0 or PC6 for CMP1
      \arg        CMP_NONINVERTING_INPUT_PF4_PG7: CMP noninverting input PF4 for CMP0 or PG7 for CMP1
      \arg        CMP_NONINVERTING_INPUT_PA2_PJ11: CMP noninverting input PA2 for CMP0 or PJ11 for CMP1
      \arg        CMP_NONINVERTING_INPUT_PC2_PA14: CMP noninverting input PC2 for CMP0 or PA14 for CMP1
      \arg        CMP_NONINVERTING_INPUT_PA1_PK1: CMP noninverting input PA1 for CMP0 or PK1 for CMP1
      \arg        CMP_NONINVERTING_INPUT_PF3_PK2: CMP noninverting input PF3 for CMP0 or PK2 for CMP1
      \arg        CMP_NONINVERTING_INPUT_PH2_PG2: CMP noninverting input PH2 for CMP0 or PG2 for CMP1
      \arg        CMP_NONINVERTING_INPUT_PH3_PG5: CMP noninverting input PH3 for CMP0 or PG5 for CMP1
      \arg        CMP_NONINVERTING_INPUT_PA14: CMP noninverting input PA14(only for CMP0)
      \arg        CMP_NONINVERTING_INPUT_PC6: CMP noninverting input PC6(only for CMP0)
      \arg        CMP_NONINVERTING_INPUT_PG7:  CMP noninverting input PG7(only for CMP0)
    \param[out] none
    \retval     none
*/
void cmp_noninverting_input_select(uint32_t cmp_periph, uint32_t noninverting_input)
{
    uint32_t temp;

