sorosaulong-ux/gd32-test-project/Library/gd32a7xx_cmp.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_CMP_PERIPH(cmp_periph)) {
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x0003U), ERR_PERIPH);
    }else if(NOT_CMP_NONINVERTING_INPUT(noninverting_input)){
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x0003U), ERR_PARAM_INVALID);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        temp = CMP_CS(cmp_periph);
        /* initialize comparator mode */
        temp &= ~(uint32_t)(CMP_CS_CMPXPESEL | CMP_CS_CMPXPSEL | CMP_CS_CMPXPESEL3);
        temp |= (uint32_t)noninverting_input;
        CMP_CS(cmp_periph) = temp;
    }
}

/*!
    \brief      initialize comparator output (API_ID(0x0004U))
    \param[in]  cmp_periph: CMPx(x=0,1)
    \param[in]  output_selection
                only one parameter can be selected which is shown as below:
      \arg        CMP_OUTPUT_NONE: output no selection
      \arg        CMP_OUTPUT_TIMER0_IC0_TIMER20_IC0: CMP0 output TIMER0_CH0 input capture, CMP1 output TIMER20_CH0 input capture
      \arg        CMP_OUTPUT_TIMER7_IC0_TIMER60_IC0: CMP0 output TIMER7_CH0 input capture, CMP1 output TIMER60_CH0 input capture
    \param[in]  output_polarity
                only one parameter can be selected which is shown as below:
      \arg        CMP_OUTPUT_POLARITY_INVERTED: output is inverted
      \arg        CMP_OUTPUT_POLARITY_NONINVERTED: output is not inverted
    \param[out] none
    \retval     none
*/
void cmp_output_init(uint32_t cmp_periph, uint32_t output_selection, uint32_t output_polarity)
{
    uint32_t temp;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_CMP_PERIPH(cmp_periph)) {
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x0004U), ERR_PERIPH);
    }else if(NOT_CMP_OUTPUT_SELECTION(output_selection)){
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x0004U), ERR_PARAM_INVALID);
    }else if(NOT_CMP_OUTPUT_POLARITY(output_polarity)){
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x0004U), ERR_PARAM_INVALID);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        temp = CMP_CS(cmp_periph);
        /* initialize comparator  output */
        temp &= ~(uint32_t)CMP_CS_CMPXOSEL;
        temp |= (uint32_t)output_selection;
        /* output polarity */
        if(CMP_OUTPUT_POLARITY_INVERTED == output_polarity) {
            temp |= (uint32_t)CMP_CS_CMPXPL;
        } else {
            temp &= ~(uint32_t)CMP_CS_CMPXPL;
        }
        CMP_CS(cmp_periph) = temp;
    }
}

/*!
    \brief      initialize comparator blanking function (API_ID(0x0005U))
    \param[in]  cmp_periph: CMPx(x=0,1)
    \param[in]  blanking_source_selection
                only one parameter can be selected which is shown as below:
      \arg        CMP_BLANKING_NONE: CMP no blanking source
      \arg        CMP_BLANKING_TIMER0_OC1: CMP TIMER0_CH1 output compare signal selected as blanking source
      \arg        CMP_BLANKING_TIMER1_OC1: CMP TIMER1_CH1 output compare signal selected as blanking source
      \arg        CMP_BLANKING_TIMER7_OC1: CMP TIMER7_CH1 output compare signal selected as blanking source
    \param[out] none
    \retval     none
*/
void cmp_blanking_init(uint32_t cmp_periph, uint32_t blanking_source_selection)
{
    uint32_t temp;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_CMP_PERIPH(cmp_periph)) {
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x0005U), ERR_PERIPH);
    }else if(NOT_CMP_BLK_SOURCE_SEL(blanking_source_selection)){
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x0005U), ERR_PARAM_INVALID);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        temp = CMP_CS(cmp_periph);
        temp &= ~(uint32_t)CMP_CS_CMPXBLK;
        temp |= (uint32_t)blanking_source_selection;
        CMP_CS(cmp_periph) = temp;
    }
}

/*!
    \brief      initialize comparator round robin clock (API_ID(0x0006U))
    \param[in]  cmp_periph: CMPx(x=0,1)
    \param[in]  sample_clock:
                only one parameter can be selected which is shown as below:
      \arg        RRCTL_RRSAMCFG_xCLK(x=0,1,2,3)
    \param[in]  init_delay:
                only one parameter can be selected which is shown as below:
      \arg        RRCTL_RRTINIT_xCLK(x=1~63)
    \param[out] none
    \retval     none
*/
void cmp_roundrobin_clock_init(uint32_t cmp_periph, uint32_t sample_clock, uint32_t init_delay)
{
    uint32_t temp;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_CMP_PERIPH(cmp_periph)) {
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x0006U), ERR_PERIPH);
    }else if(NOT_CMP_SAMPLE_CLOCK(sample_clock)){
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x0006U), ERR_PARAM_INVALID);
    }else if(CMP_RR_INIT_DELAY_CLOCK(init_delay)){
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x0006U), ERR_PARAM_INVALID);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        temp = CMP_RRCTL(cmp_periph);
        temp &= ~(uint32_t)(CMP_RRCTL_RRSAMCFG | CMP_RRCTL_RRTINIT);
        temp |= (uint32_t)sample_clock | init_delay;
        CMP_RRCTL(cmp_periph) = temp;
    }
}

/*!
    \brief      initialize comparator round robin channel config (API_ID(0x0007U))
    \param[in]  cmp_periph: CMPx(x=0,1)
    \param[in]  specified_port: 
                only one parameter can be selected which is shown as below:
      \arg        CMP_RRINVERTING_PORT: select the inverting port
      \arg        CMP_RRNONINVERTING_PORT: select the non-inverting port
    \param[in]  specified_channel: select comparator round robin fixed channel
                only one parameter can be selected which is shown as below:
      \arg        CMP_RRSPE_CHANNEL_x(x = 0~10)
    \param[in]  non_specified_channel: select comparator round robin non-specified_channel channel
                one or more parameters can be selected which are shown as below:
      \arg        CMP_RRNONSPE_CHANNEL_x(x = 0~10)
    \param[out] none
    \retval     none
*/
void cmp_roundrobin_channel_config(uint32_t cmp_periph, uint32_t specified_port, uint32_t specified_channel, uint32_t non_specified_channel)
{
    uint32_t temp;

