sorosaulong-ux/gd32-test-project/Library/gd32a7xx_cmp.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_CMP_PERIPH(cmp_periph)) {
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x0007U), ERR_PERIPH);
    }else if(NOT_CMP_SPECIFIED_PORT(specified_port)){
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x0007U), ERR_PARAM_INVALID);
    }else if(NOT_CMP_SPECIFIED_CHANNEL(specified_channel)){
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x0007U), ERR_PARAM_INVALID);
    }else if(NOT_CMP_NONSPE_CHANNEL(non_specified_channel)){
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x0007U), ERR_PARAM_INVALID);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        temp = CMP_RRCHCTL(cmp_periph);
        temp &= ~(uint32_t)(CMP_RRCHCTL_SPEPS | CMP_RRCHCTL_RRSPECHS);
        temp |= (uint32_t)specified_port | specified_channel | non_specified_channel;
        CMP_RRCHCTL(cmp_periph) = temp;
    }
}
/*  */
/*!
    \brief      initialize comparator round robin non-specified channel pre-set state (API_ID(0x0008U))
    \param[in]  cmp_periph: CMPx(x=0,1)
    \param[in]  non_specified_channel: select all comparator round robin non-specified_channel, which the pre_define channel state should be set
                one or more parameters can be selected which are shown as below:
      \arg        CMP_RRNONSPE_CHANNEL_x(x = 0~10) (all channels of the pre_define need to be written together)
    \param[out] none
    \retval     none
*/
void cmp_roundrobin_channel_preset(uint32_t cmp_periph, uint32_t non_specified_channel)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_CMP_PERIPH(cmp_periph)) {
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x0008U), ERR_PERIPH);
    }else if(NOT_CMP_NONSPE_CHANNEL(non_specified_channel)){
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x0008U), ERR_PARAM_INVALID);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        CMP_RRCOMO(cmp_periph) = (uint32_t)non_specified_channel;
    }
    
}

/*!
    \brief      comparator round robin timer trigger value config (API_ID(0x0009U))
    \param[in]  cmp_periph: CMPx(x=0,1)
    \param[in]  value: timer trigger value(0x00000000~0xFFFFFFFF)
    \param[out] none
    \retval     none
*/
void cmp_roundrobin_trigger_timer_value_config(uint32_t cmp_periph, uint32_t value)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_CMP_PERIPH(cmp_periph)) {
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x0009U), ERR_PERIPH);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        CMP_RRTTRGV(cmp_periph) = (uint32_t)value;
    }
}

/*!
    \brief      comparator round robin timer trigger value reload (API_ID(0x000AU))
    \param[in]  cmp_periph: CMPx(x=0,1)
    \param[out] none
    \retval     none
*/
void cmp_roundrobin_trigger_timer_value_reload(uint32_t cmp_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_CMP_PERIPH(cmp_periph)) {
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x000AU), ERR_PERIPH);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        CMP_RRTCTL(cmp_periph) |= (uint32_t)CMP_RRTCTL_UPVAL;
    }
}

/*!
    \brief      comparator round robin timer counter clear (API_ID(0x000BU))
    \param[in]  cmp_periph: CMPx(x=0,1)
    \param[out] none
    \retval     none
*/
void cmp_roundrobin_trigger_timer_counter_clear(uint32_t cmp_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_CMP_PERIPH(cmp_periph)) {
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x000BU), ERR_PERIPH);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        CMP_RRTCTL(cmp_periph) |= (uint32_t)CMP_RRTCTL_CLRCNT;
    }
}

/*!
    \brief      enable comparator (API_ID(0x000CU))
    \param[in]  cmp_periph: CMPx(x=0,1)
    \param[out] none
    \retval     none
*/
void cmp_enable(uint32_t cmp_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_CMP_PERIPH(cmp_periph)) {
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x000CU), ERR_PERIPH);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        CMP_CS(cmp_periph) |= (uint32_t)CMP_CS_CMPXEN;
    }
}

/*!
    \brief      disable comparator (API_ID(0x000DU))
    \param[in]  cmp_periph: CMPx(x=0,1)
    \param[out] none
    \retval     none
*/
void cmp_disable(uint32_t cmp_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_CMP_PERIPH(cmp_periph)) {
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x000DU), ERR_PERIPH);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        CMP_CS(cmp_periph) &= ~(uint32_t)CMP_CS_CMPXEN;
    }
}

/*!
    \brief      enable the voltage scaler (API_ID(0x000EU))
    \param[in]  cmp_periph: CMPx(x=0,1)
    \param[out] none
    \retval     none
*/
void cmp_voltage_scaler_enable(uint32_t cmp_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_CMP_PERIPH(cmp_periph)) {
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x000EU), ERR_PERIPH);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        CMP_CS(cmp_periph) |= (uint32_t)CMP_CS_CMPXSEN;
    }
}

/*!
    \brief      disable the voltage scaler (API_ID(0x000FU))
    \param[in]  cmp_periph: CMPx(x=0,1)
    \param[out] none
    \retval     none
*/
void cmp_voltage_scaler_disable(uint32_t cmp_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_CMP_PERIPH(cmp_periph)) {
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x000FU), ERR_PERIPH);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        CMP_CS(cmp_periph) &= ~(uint32_t)CMP_CS_CMPXSEN;
    }
}

/*!
    \brief      enable the scaler bridge (API_ID(0x0010U))
    \param[in]  cmp_periph: CMPx(x=0,1)
    \param[out] none
    \retval     none
*/
void cmp_scaler_bridge_enable(uint32_t cmp_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_CMP_PERIPH(cmp_periph)) {
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x0010U), ERR_PERIPH);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        CMP_CS(cmp_periph) |= (uint32_t)CMP_CS_CMPXBEN;
    }
}

/*!
    \brief      disable the scaler bridge (API_ID(0x0011U))
    \param[in]  cmp_periph: CMPx(x=0,1)
    \param[out] none
    \retval     none
*/
void cmp_scaler_bridge_disable(uint32_t cmp_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_CMP_PERIPH(cmp_periph)) {
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x0011U), ERR_PERIPH);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        CMP_CS(cmp_periph) &= ~(uint32_t)CMP_CS_CMPXBEN;
    }
}

/*!
    \brief      enable comparator round robin (API_ID(0x0012U))
    \param[in]  cmp_periph: CMPx(x=0,1)
    \param[out] none
    \retval     none
*/
void cmp_roundrobin_enable(uint32_t cmp_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_CMP_PERIPH(cmp_periph)) {
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x0012U), ERR_PERIPH);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        CMP_RRCTL(cmp_periph) |= (uint32_t)CMP_RRCTL_RREN;
    }
}

/*!
    \brief      disable comparator round robin (API_ID(0x0013U))
    \param[in]  cmp_periph: CMPx(x=0,1)
    \param[out] none
    \retval     none
*/
void cmp_roundrobin_disable(uint32_t cmp_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_CMP_PERIPH(cmp_periph)) {
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x0013U), ERR_PERIPH);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        CMP_RRCTL(cmp_periph) &= ~(uint32_t)CMP_RRCTL_RREN;
    }
}

/*!
    \brief      enable comparator round robin counter (API_ID(0x0014U))
    \param[in]  cmp_periph: CMPx(x=0,1)
    \param[out] none
    \retval     none
*/
void cmp_roundrobin_trigger_timer_counter_enable(uint32_t cmp_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_CMP_PERIPH(cmp_periph)) {
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x0014U), ERR_PERIPH);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        CMP_RRTCTL(cmp_periph) |= (uint32_t)CMP_RRTCTL_RRCEN;
    }
}

/*!
    \brief      disable comparator round robin counter (API_ID(0x0015U))
    \param[in]  cmp_periph: CMPx(x=0,1)
    \param[out] none
    \retval     none
*/
void cmp_roundrobin_trigger_timer_counter_disable(uint32_t cmp_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_CMP_PERIPH(cmp_periph)) {
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x0015U), ERR_PERIPH);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        CMP_RRTCTL(cmp_periph) &= ~(uint32_t)CMP_RRTCTL_RRCEN;
    }
}

/*!
    \brief      enable comparator round robin trigger (API_ID(0x0016U))
    \param[in]  cmp_periph: CMPx(x=0,1)
    \param[out] none
    \retval     none
*/
void cmp_roundrobin_trigger_enable(uint32_t cmp_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_CMP_PERIPH(cmp_periph)) {
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x0016U), ERR_PERIPH);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        CMP_RRTCTL(cmp_periph) |= (uint32_t)CMP_RRTCTL_RRTRGEN;
    }
}

/*!
    \brief      disable comparator round robin trigger (API_ID(0x0017U))
    \param[in]  cmp_periph: CMPx(x=0,1)
    \param[out] none
    \retval     none
*/
void cmp_roundrobin_trigger_disable(uint32_t cmp_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_CMP_PERIPH(cmp_periph)) {
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x0017U), ERR_PERIPH);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        CMP_RRTCTL(cmp_periph) &= ~(uint32_t)CMP_RRTCTL_RRTRGEN;
    }
}

/*!
    \brief      lock the comparator (API_ID(0x0018U))
    \param[in]  cmp_periph: CMPx(x=0,1)
    \param[out] none
    \retval     none
*/
void cmp_lock_enable(uint32_t cmp_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_CMP_PERIPH(cmp_periph)) {
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x0018U), ERR_PERIPH);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* lock CMP */
        CMP_CS(cmp_periph) |= (uint32_t)CMP_CS_CMPXLK;
    }
}

/*!
    \brief      get output level (API_ID(0x0019U))
    \param[in]  cmp_periph: CMPx(x=0,1)
    \param[out] none
    \retval     the output level
      \arg        CMP_OUTPUTLEVEL_HIGH: output high level
      \arg        CMP_OUTPUTLEVEL_LOW: output low level
*/
uint32_t cmp_output_level_get(uint32_t cmp_periph)
{
    uint32_t reval = CMP_OUTPUTLEVEL_LOW;

