sorosaulong-ux/gd32-test-project/Library/gd32a7xx_cmp.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_CMP_PERIPH(cmp_periph)) {
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x0019U), ERR_PERIPH);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* get output level of CMP */
        if((uint32_t)RESET != (CMP_CS(cmp_periph) & CMP_CS_CMPXO)) {
            reval = CMP_OUTPUTLEVEL_HIGH;
        } else {
            reval = CMP_OUTPUTLEVEL_LOW;
        }
    }
    return reval;
}

/*!
    \brief      get comparator round robin non-specified_channel compare result flag (API_ID(0x001AU))
    \param[in]  cmp_periph: CMPx(x=0,1)
    \param[in]  non_specified_channel: select comparator round robin non-specified_channel channel
                only one parameter can be selected which is shown as below:
      \arg        CMP_RRNONSPE_CHANNEL_x(x = 0~10)
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus cmp_roundrobin_flag_get(uint32_t cmp_periph, uint32_t non_specified_channel)
{
    FlagStatus reval = RESET;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_CMP_PERIPH(cmp_periph)) {
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x001AU), ERR_PERIPH);
    }else if(NOT_CMP_NONSPE_CHANNEL(non_specified_channel)){
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x001AU), ERR_PARAM_INVALID);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* get non-specified_channel flag of CMP */
        if((uint32_t)RESET != (CMP_RRCOMF(cmp_periph) & non_specified_channel)) {
            reval = SET;
        } else {
            reval = RESET;
        }
    }
    return reval;
}

/*!
    \brief      clear comparator round robin non-specified_channel compare result flag (API_ID(0x001BU))
    \param[in]  cmp_periph: CMPx(x=0,1)
    \param[in]  non_specified_channel: select comparator round robin non-specified_channel channel
                one or more parameters can be selected which are shown as below:
      \arg        CMP_RRNONSPE_CHANNEL_x(x = 0~10)
    \param[out] none
    \retval     none
*/
void cmp_roundrobin_flag_clear(uint32_t cmp_periph, uint32_t non_specified_channel)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_CMP_PERIPH(cmp_periph)) {
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x001BU), ERR_PERIPH);
    }else if(NOT_CMP_NONSPE_CHANNEL(non_specified_channel)){
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x001BU), ERR_PARAM_INVALID);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        CMP_RRCOMF(cmp_periph) = non_specified_channel;
    }
}

/*!
    \brief      enable comparator round robin interrupt (API_ID(0x001CU))
    \param[in]  cmp_periph: CMPx(x=0,1)
    \param[out] none
    \retval     none
*/
void cmp_roundrobin_interrupt_enable(uint32_t cmp_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_CMP_PERIPH(cmp_periph)) {
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x001CU), ERR_PERIPH);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        CMP_RRCTL(cmp_periph) |= (uint32_t)CMP_RRCTL_RRIE;
    }
}

/*!
    \brief      disable comparator round robin interrupt (API_ID(0x001DU))
    \param[in]  cmp_periph: CMPx(x=0,1)
    \param[out] none
    \retval     none
*/
void cmp_roundrobin_interrupt_disable(uint32_t cmp_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_CMP_PERIPH(cmp_periph)) {
        fw_debug_report_err(CMP_MODULE_ID, API_ID(0x001DU), ERR_PERIPH);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        CMP_RRCTL(cmp_periph) &= ~(uint32_t)CMP_RRCTL_RRIE;
    }
}
